---
kind: type
id: T:Autodesk.Revit.DB.Analysis.SpatialFieldManager
source: html/0a6d155e-6ef1-7215-f8f1-c1d8203797ee.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager

Exposes all API for an external analysis application.
 Its primary role is creation, deletion and modification of SpatialFieldElement elements.

## Syntax (C#)
```csharp
public class SpatialFieldManager : Element
```